Revit 2027 API
LinePatternSegment Constructor
Overload List
Name | Description
LinePatternSegment() |  Creates a line pattern segment.
LinePatternSegment(LinePatternSegmentType, Double) |  Creates a line pattern segment with given type and length.
Top
See Also
Reference
LinePatternSegment Class
Autodesk.Revit.DB Namespace